Repository: tmessaoudi-official/angular-app
Catalog: i18n/messages.*.xlf
Languages: ar, de, es, pt

source: app.index.title
ar: app.index.title_ar
es: app.index.title_es
pt: app.index.title_pt

source: app.dummy.title
ar: app.dummy.title_ar
es: app.dummy.title_es
pt: app.dummy.title_pt

source: app.dumb.title
ar: app.dumb.title_ar
es: app.dumb.title_es
pt: app.dumb.title_pt

source: app.dumb.title2
ar: app.dumb.title2_ar
es: app.dumb.title2_es
pt: app.dumb.title2_pt

source: app.dumber.title
ar: app.dumber.title_ar
es: app.dumber.title_es
pt: app.dumber.title_pt

source: can t set minutes less than 0
es: can t set minutes less than 0 ar

source: app.home.title
ar: app.home.title_ar
es: app.home.title_es
pt: app.home.title_pt

source: app.welcome
ar: app.welcome_ar
es: app.welcome_es
pt: app.welcome_pt

# app_welcome
source: app.welcome_with_meaning_and_description_and_id
ar: app.welcome_with_meaning_and_description_and_id_ar
de: app.welcome_with_meaning_and_description_and_id_de
es: app.welcome_with_meaning_and_description_and_id_es
pt: app.welcome_with_meaning_and_description_and_id_pt

# app_welcome_second
source: app.welcome_with_meaning_and_description_and_id
ar: app.welcome_with_meaning_and_description_and_id_ar
de: app.welcome_with_meaning_and_description_and_id_de
es: app.welcome_with_meaning_and_description_and_id_es
pt: app.welcome_with_meaning_and_description_and_id_pt

source: {VAR_PLURAL, plural, =0 {now} =1 {one_minutes} other {INTERPOLATIONmany}}
es: {VAR_PLURAL, plural, =0 {now} =1 {one_minutes} other {INTERPOLATIONmany}}_es

source: app.minutes.ICU
es: app.minutes.ICU_es

source: {VAR_SELECT, select, male {male} female {female} other {other}}
es: {VAR_SELECT, select, male {male} female {female} other {other}}_es

source: app.gender.ICU
es: app.gender.ICU_es

source: app.not_found
ar: app.not_found_ar
es: app.not_found_es
pt: app.not_found_pt

source: app.nav.home
ar: app.nav.home_ar
es: app.nav.home_es
pt: app.nav.home_pt

source: app.nav.dumbest.module
es: app.nav.dumbest.module_es

source: app.nav.dummy
ar: app.nav.dummy_ar
es: app.nav.dummy_es
pt: app.nav.dummy_pt

source: app.nav.dumb
ar: app.nav.dumb_ar
es: app.nav.dumb_es
pt: app.nav.dumb_pt

source: app.nav.dumber
ar: app.nav.dumber_ar
es: app.nav.dumber_es
pt: app.nav.dumber_pt

source: app.nav.dumber_with_id
ar: app.nav.dumber_with_id_ar
es: app.nav.dumber_with_id_es
pt: app.nav.dumber_with_id_pt

source: app.footer.text PH
es: app.footer.text PH_es

# ngb.alert.close
source: Close
ar: Close_ar
de: Close_de
es: Close_es
pt: Close_pt

# ngb.carousel.previous
source: Previous
ar: Previous_ar
de: Previous_de
es: Previous_es
pt: Previous_pt

# ngb.carousel.next
source: Next
ar: Next_ar
de: Next_de
es: Next_es
pt: Next_pt

# ngb.datepicker.previous-month
source: Previous month
ar: Previous month_ar
de: Previous month_de
es: Previous month_es
pt: Previous month_pt

# ngb.datepicker.next-month
source: Next month
ar: Next month_ar
de: Next month_de
es: Next month_es
pt: Next month_pt

# ngb.datepicker.select-month
source: Select month
ar: Select month_ar
de: Select month_de
es: Select month_es
pt: Select month_pt

# ngb.datepicker.select-year
source: Select year
ar: Select year_ar
de: Select year_de
es: Select year_es
pt: Select year_pt

# ngb.pagination.first-aria
source: First
ar: First_ar
de: First_de
es: First_es
pt: First_pt

# ngb.pagination.previous-aria
source: Previous
ar: Previous_ar
de: Previous_de
es: Previous_es
pt: Previous_pt

# ngb.pagination.next-aria
source: Next
ar: Next_ar
de: Next_de
es: Next_es
pt: Next_pt

# ngb.pagination.last-aria
source: Last
ar: Last_ar
de: Last_de
es: Last_es
pt: Last_pt

# ngb.progressbar.value
source: INTERPOLATION
es: INTERPOLATION_es

# ngb.timepicker.HH
source: HH
ar: HH_ar
de: HH_de
es: HH_es
pt: HH_pt

# ngb.timepicker.hours
source: Hours
ar: Hours_ar
de: Hours_de
es: Hours_es
pt: Hours_pt

# ngb.timepicker.MM
source: MM
ar: MM_ar
de: MM_de
es: MM_es
pt: MM_pt

# ngb.timepicker.minutes
source: Minutes
ar: Minutes_ar
de: Minutes_de
es: Minutes_es
pt: Minutes_pt

# ngb.timepicker.increment-hours
source: Increment hours
ar: Increment hours_ar
de: Increment hours_de
es: Increment hours_es
pt: Increment hours_pt

# ngb.timepicker.decrement-hours
source: Decrement hours
ar: Decrement hours_ar
de: Decrement hours_de
es: Decrement hours_es
pt: Decrement hours_pt

# ngb.timepicker.increment-minutes
source: Increment minutes
ar: Increment minutes_ar
de: Increment minutes_de
es: Increment minutes_es
pt: Increment minutes_pt

# ngb.timepicker.decrement-minutes
source: Decrement minutes
ar: Decrement minutes_ar
de: Decrement minutes_de
es: Decrement minutes_es
pt: Decrement minutes_pt

# ngb.timepicker.SS
source: SS
ar: SS_ar
de: SS_de
es: SS_es
pt: SS_pt

# ngb.timepicker.seconds
source: Seconds
ar: Seconds_ar
de: Seconds_de
es: Seconds_es
pt: Seconds_pt

# ngb.timepicker.increment-seconds
source: Increment seconds
ar: Increment seconds_ar
de: Increment seconds_de
es: Increment seconds_es
pt: Increment seconds_pt

# ngb.timepicker.decrement-seconds
source: Decrement seconds
ar: Decrement seconds_ar
de: Decrement seconds_de
es: Decrement seconds_es
pt: Decrement seconds_pt

# ngb.timepicker.AM
source: INTERPOLATION
es: INTERPOLATION_es

# ngb.toast.close-aria
source: Close
ar: Close_ar
de: Close_de
es: Close_es
pt: Close_pt

source: {VAR_PLURAL, plural, =0 {now} =1 {one_minutes} other {INTERPOLATIONmany}}
pt: {VAR_PLURAL, plural, =0 {now} =1 {one_minutes} other {INTERPOLATIONmany}}_pt

source: app.minutes.ICU
pt: app.minutes.ICU_pt

source: {VAR_SELECT, select, male {male} female {female} other {other}}
pt: {VAR_SELECT, select, male {male} female {female} other {other}}_pt

source: app.gender.ICU
pt: app.gender.ICU_pt

source: app.footer.text PH
ar: app.footer.text PH_ar
pt: app.footer.text PH_pt

# ngb.progressbar.value
source: INTERPOLATION
ar: INTERPOLATION_ar
pt: INTERPOLATION_pt

# ngb.timepicker.AM
source: INTERPOLATION
ar: INTERPOLATION_ar
pt: INTERPOLATION_pt

source: app.dummy.title
de: app.dummy.title_de

source: app.dumb.title
de: app.dumb.title_de

source: app.dumber.title
de: app.dumber.title_de

source: app.home.title
de: app.home.title_de

source: app.welcome
de: app.welcome_de

source: {VAR_PLURAL, plural, =0 {now} =1 {one_minutes} other {{INTERPOLATION}many}}
de: {VAR_PLURAL, plural, =0 {now} =1 {one_minutes} other {{INTERPOLATION}many}}_de

source: app.minutes.{minutes, plural, =0 {now} =1 {one_minutes} other {{{minutes}}many}}
de: app.minutes.{minutes, plural, =0 {now} =1 {one_minutes} other {{{minutes}}many}}_de

source: {VAR_SELECT, select, male {male} female {female} other {other}}
de: {VAR_SELECT, select, male {male} female {female} other {other}}_de

source: app.gender.{gender, select, male {male} female {female} other {other}}
de: app.gender.{gender, select, male {male} female {female} other {other}}_de

source: app.not_found
de: app.not_found_de

source: app.nav.home
de: app.nav.home_de

source: app.nav.dummy
de: app.nav.dummy_de

source: app.nav.dumb
de: app.nav.dumb_de

source: app.nav.dumber
de: app.nav.dumber_de

source: app.nav.dumber_with_id
de: app.nav.dumber_with_id_de

source: app.footer.text this.name
de: app.footer.text_de this.name

# ngb.progressbar.value
source: turn this._max;
de: turn this._max;_de

# ngb.timepicker.AM
source: nts ControlValu
de: nts ControlValu_de
